## 팩토리얼은 단순 for문으로도 구할 수 있지만, 재귀함수로도 가능하다 !
#--------------------------------------------------------------------------------------------
n = int(input())
def recursion(n) :
    if n <= 1 :
        return 1
    
    # 마지막 값만 출력하는 거니까, 변수 새로 만들지 않고 바로 출력할 수 있도록 return값 만들어주기 !
    return n*recursion(n-1)

print(recursion(n))

#--------------------------------------------------------------------------------------------
#--------------------------------------------------------------------------------------------
# for문으로 구하기
# 함수 없이
n_o = 1
for i in range(1, n+1) :
    n_o *= i
    
print(n_o)

#--------------------------------------------------------------------------------------------
# 함수 사용
def factorial(n) :
    n_o = 1
    for i in range(1, n+1) :
        n_o *= 1
    return n_o    
    